Revit 2020 API
Units Members
The Units type exposes the following members.
Constructors
Name | Description
Units
 Creates a new Units object with default settings for Metric or Imperial units.
Methods
Name | Description
Dispose
Releases all resources used by the Units
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetFormatOptions
 Gets the default FormatOptions for a unit type.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetModifiableUnitTypes
 Gets all unit types for which the default FormatOptions can be modified.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsModifiableUnitType
 Checks whether the default FormatOptions can be modified for a given unit type.
SetFormatOptions
 Sets the default FormatOptions for a unit type.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
DecimalSymbol
 The symbol used to separate the integer and fractional parts of a number.
DigitGroupingAmount
 The number of digits in each group when numbers are formatted with digit grouping.
DigitGroupingSymbol
 The symbol used to separate groups of digits when numbers are formatted with digit grouping.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
Units Class
Autodesk.Revit.DB Namespace